### Question-1

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [2]:
for i in range(len(df)):
    if pd.isnull(df.FlightNumber.loc[i,]): 
        df.loc[i,'FlightNumber']=df.loc[i-1,'FlightNumber']+10

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [5]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

### Question-2

In [6]:
b,c = [],[]
for i in range(len(df)):
    a = df.From_To.loc[i].split('_')
    b.append(a[0])
    c.append(a[1])
temp_col1=pd.DataFrame(b,columns=['Col1'])
temp_col2=pd.DataFrame(c,columns=['Col2'])

In [7]:
temp_col1

       Col1
0    LoNDon
1    MAdrid
2    londON
3  Budapest
4  Brussels

In [8]:
temp_col2

        Col2
0      paris
1      miLAN
2  StockhOlm
3      PaRis
4     londOn

### Question-3

In [9]:
for i in range(len(temp_col1)):
    temp_col1['Col1'][i]=temp_col1['Col1'].iloc[i][0].upper()+temp_col1['Col1'].iloc[i][1:].lower()
    
for i in range(len(temp_col2)):
    temp_col2['Col2'][i]=temp_col2['Col2'].iloc[i][0].upper()+temp_col2['Col2'].iloc[i][1:].lower()

In [10]:
temp_col1

       Col1
0    London
1    Madrid
2    London
3  Budapest
4  Brussels

In [11]:
temp_col2

        Col2
0      Paris
1      Milan
2  Stockholm
3      Paris
4     London

### Question-4

In [12]:
df=df.drop('From_To',axis=1)

In [13]:
df['temp_col1']=temp_col1
df['temp_col2']=temp_col2

In [14]:
df

   FlightNumber  RecentDelays              Airline temp_col1  temp_col2
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### Question-5

In [15]:
df[['Delay_0','Delay_1','Delay_2']]=pd.DataFrame(columns=['Delay_0','Delay_1','Delay_2'])
for i in range(len(df['RecentDelays'])):
    for x in range(len(df['RecentDelays'][i])):
        df.loc[i,'Delay_'+str(x)]=df.loc[i,'RecentDelays'][x]

In [16]:
df=df.drop('RecentDelays',axis=1)

In [17]:
df

,FlightNumber,Airline,temp_col1,temp_col2,Delay_0,Delay_1,Delay_2
0,10045,KLM(!),London,Paris,23,47,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67,32,NaN